interface IItem {
  name: string;
  value: string[];
}

interface IProperty {
  title: string;
  items: IItem[];
}

interface ImenSizeClothes {
  [key: string]: IProperty;
}

export const menSizeClothes: ImenSizeClothes = {
  standartSize: {
    title: "Стандартные размеры",
    items: [
      {
        name: "Россия (RU)",
        value: ["44", "46", "48-50", "52", "54-56", "56-58", "56", "58", "60"],
      },
      {
        name: "Италия (IT)",
        value: ["42", "44", "46", "48", "50", "52", "54", "56", "58"],
      },
      {
        name: "Европа (IT)",
        value: ["40", "42", "44", "46", "48", "50", "52", "54", "56"],
      },
      {
        name: "Франция (FR)",
        value: ["38", "40", "42", "44", "46", "58", "60", "62", "64"],
      },
      {
        name: "Германия (GR)",
        value: ["36", "38", "40", "42", "44", "46", "48", "50", "52"],
      },
      {
        name: "США (US)",
        value: ["34", "36", "38", "40", "42", "44", "46", "48", "50"],
      },
    ],
  },
  individualMeasurements: {
    title: "Индивидуальные обмеры",
    items: [
      {
        name: "Обхват груди, см",
        value: ["88-91", "88-94", "95-101", "102-107", "108-114", "114-121", "112-115", "116-119", "120-125"],
      },
      {
        name: "Обхват талии, см",
        value: ["78-81", "78-82", "83-88", "89-94", "95-100", "101-106", "98-101", "102-105", "106-109"],
      },
      {
        name: "Рост",
        value: ["", "176 ± 3", "182 ± 3", "182 ± 3", "182 ± 3", "182 ± 3", "", "", ""],
      },
    ],
  },
};
